     /*---------------------------------------------------------------------
     /* Program Name:  CM002D
     /* Program Description:  Customer Listing Selection
     /* Program Narrative:  Display the list of customers.  Allow the search
     /*                      to change and reload the list.  When one is
     /*                      selected, call the maintenance program.
     /*
     /* AFTER COMPILE:  CHGDSPF FILE(CM002D) RSTDSP(*YES)
     /*
     /* Change Log:
     /* Marker  Name         Date      Narrative
     /* ------  -----------  --------  -------------------------------------
     /*         S.Meisinger  10/04/25  New Program
     /*---------------------------------------------------------------------
     *************************************************************************
     **  Screen Generics
     *************************************************************************
     A                                      DSPSIZ(27 132 *DS4)
     A                                      CHGINPDFT(UL FE)
     A                                      MSGLOC(27)
     A                                      INDARA
     A                                      ERRSFL
     A                                      PRINT
     A                                      HELP
     *************************************************************************
     **  Header Format
     *************************************************************************
     A          R HEADER1
     A                                      OVERLAY
     A            TITLEA         1A  P
      *
     A            ##PROG        10A  O  1  2
     A            TITLE1        80A     1 26
     A                                      DSPATR(&TITLEA)
     A                                  1123DATE
     A                                      EDTCDE(Y)
     A                                  2  2USER
     A            TITLE2        80A     2 26
     A                                      DSPATR(&TITLEA)
     A                                  2123TIME
     *************************************************************************
     **  Footer Format
     *************************************************************************
     A          R FOOTER1
     A                                      OVERLAY
     A            FERRMSGA       1A  P
     A            FKEYSA         1A  P
     A            FERRMSG       80A    24 22DSPATR(&FERRMSGA)
     A            FKEYLINE     125A    26  3DSPATR(&FKEYSA)
     *************************************************************************
     **  Subfile Format
     *************************************************************************
     A          R SFL1                      SFL
     A  98                                  SFLNXTCHG
     A            SFLRRNR       10S 0H
     A            SFLCSRROW     10S 0H
     A            SFLREPPDN      6S 0H
     A            SFLOA          1A  P
     A            SFLIOA         1A  P
     A            SFAOID         9Y 0H
     A            SFL1RRN        5  0H
     A            SFLOID         9Y 0H
     A            SFLSEL         1A  B 10 13
     A                                      DSPATR(&SFLIOA)
     A            SFLNAME   R        O 10 21REFFLD(CUNAME CUSTOMER)
     A                                      DSPATR(&SFLOA)
     *************************************************************************
     **  Subfile Control Format
     *************************************************************************
     A          R SFLCTL1                   SFLCTL(SFL1)
     A                                      CF06
     A                                      CF12
     A                                      SFLSIZ(20)
     A                                      SFLPAG(12)
     A                                      PAGEDOWN(27)
     A                                      KEEP
     A                                      BLINK
     A                                      OVERLAY
     A                                      PUTOVR
     A                                      SFLCSRRRN(&CURSOR)
     A                                      RTNCSRLOC(*MOUSE &ROW &COL)
     A                                      RTNCSRLOC(&CSRRCD &CSRFLD &CSRPOS)
     A  90                                  SFLDSP
     A  91                                  SFLDSPCTL
     A N91                                  SFLCLR
     A  90                                  SFLEND(*MORE)
     A  99                                  ALARM
     **
     A            ROW            3S 0H
     A            COL            3S 0H
     A            SFLRCD         4S 0H      SFLRCDNBR
     A            CSRRCD        10A  H
     A            CSRFLD        10A  H
     A            CSRPOS         4S 0H
     A            CURSOR         5S 0H
     A            OPTIONA        1A  P
     A            HEADERA        1A  P
     A            SEARCHA        1A  P
     A                                  5  4'Current Search:'
     A                                      DSPATR(&SEARCHA)
     A            HDRSRCH       40A  B  5 21CHECK(LC)
     A                                  5 65'F6 = Update Search'
     A                                      DSPATR(&SEARCHA)
     A            OPTLINE      100A     7  3
     A                                      DSPATR(&OPTIONA)
     A                                  9 11'Select'
     A                                      DSPATR(&HEADERA)
     A                                  9 21'Customer Name'
     A                                      DSPATR(&HEADERA)
     *************************************************************************
     **  Assume Format
     *************************************************************************
     A          R DUMMY1
     A                                      OVERLAY
     A                                      PUTOVR
     A                                  5  5' '
     ***********************************************************************

