     *************************************************************************
     /*---------------------------------------------------------------------
     /* Program Name:  CM001D
     /* Program Description:  Customer Master Maintenance
     /* Program Narrative:  Enter either a customer name, unique customer name
     /*                      or press F8 and be taken to the maintenance screen.
     /*                      Enter a customer name that appears on more than one
     /*                      customer or press F6 and be taken to the listing
     /*                      screen to make a selection.
     /*
     /* AFTER COMPILE:  CHGDSPF FILE(CM001D) RSTDSP(*YES)
     /*
     /* Change Log:
     /* Marker  Name         Date      Narrative
     /* ------  -----------  --------  -------------------------------------
     /*         S.Meisinger  10/04/25  New Program
     /*---------------------------------------------------------------------
     **  Screen Generics
     *************************************************************************
     A                                      DSPSIZ(27 132 *DS4)
     A                                      CHGINPDFT(UL FE)
     A                                      MSGLOC(27)
     A                                      INDARA
     A                                      ERRSFL
     A                                      PRINT
     A                                      HELP
     *************************************************************************
     **  Header Format
     *************************************************************************
     A          R HEADER1
     A                                      OVERLAY
     A            TITLEA         1A  P
      *
     A            ##PROG        10A  O  1  2
     A            TITLE1        80A     1 26
     A                                      DSPATR(&TITLEA)
     A                                  1123DATE
     A                                      EDTCDE(Y)
     A                                  2  2USER
     A            TITLE2        80A     2 26
     A                                      DSPATR(&TITLEA)
     A                                  2123TIME
     *************************************************************************
     **  Footer Format
     *************************************************************************
     A          R FOOTER1
     A                                      OVERLAY
     A            FERRMSGA       1A  P
     A            FKEYSA         1A  P
     A            FERRMSG       80A    24 22DSPATR(&FERRMSGA)
     A            FKEYLINE     125A    26  3DSPATR(&FKEYSA)
     *************************************************************************
     **  Body Format
     *************************************************************************
     A          R BODY1
     A                                      OVERLAY
     A                                      CF03
     A                                      CF06
     A                                      CF08
     A            BDYNUMNAMA     1A  P
     A            BDYTITLE1     80A  O  7 24
     A            BDYTITLE2     80A  O  8 24
     A                                 12 24'Enter Customer Number or Name:'
     A            BDYNUMNAM     40A  B 12 56CHECK(LC)
     A                                      DSPATR(&BDYNUMNAMA)
     *************************************************************************
     **  Dummy Format
     ***********************************************************************
     A          R DUMMY1                    OVERLAY
     A                                      PUTOVR
     A                                  5  2' '
     ***********************************************************************


