     *************************************************************************
     /*---------------------------------------------------------------------
     /* Program Name:  MN002D
     /* Program Description:  Menu Items Mainenance and Add
     /* Program Narrative:  If an OID is passed in, then allow the user to
     /*                      maintain the information.  If there is no OID
     /*                      allow the user to enter a new menu item.
     /*
     /* AFTER COMPILE:  CHGDSPF FILE(MN002D) RSTDSP(*YES)
     /*
     /* Change Log:
     /* Marker  Name         Date      Narrative
     /* ------  -----------  --------  -------------------------------------
     /*         S.Meisinger  10/05/25  New Program
     /*---------------------------------------------------------------------
     **  Screen Generics
     *************************************************************************
     A                                      DSPSIZ(27 132 *DS4)
     A                                      CHGINPDFT(UL FE)
     A                                      MSGLOC(27)
     A                                      INDARA
     A                                      ERRSFL
     A                                      PRINT
     A                                      HELP
     *************************************************************************
     **  Header Format
     *************************************************************************
     A          R HEADER1
     A                                      OVERLAY
     A            TITLEA         1A  P
      *
     A            ##PROG        10A  O  1  2
     A            TITLE1        80A     1 26
     A                                      DSPATR(&TITLEA)
     A                                  1123DATE
     A                                      EDTCDE(Y)
     A                                  2  2USER
     A            TITLE2        80A     2 26
     A                                      DSPATR(&TITLEA)
     A                                  2123TIME
     *************************************************************************
     **  Footer Format
     *************************************************************************
     A          R FOOTER1
     A                                      OVERLAY
     A            FERRMSGA       1A  P
     A            FKEYSA         1A  P
     A            FERRMSG       80A    24 26DSPATR(&FERRMSGA)
     A            FKEYLINE     125A    26  3DSPATR(&FKEYSA)
     *************************************************************************
     **  Body Format
     *************************************************************************
     A          R BODY1
     A                                      OVERLAY
     A                                      CF08
     A                                      CF12
     A            BDYA           1A  P
     A            BDYOID    R        H      REFFLD(MEOID MENUITEMS)
     A            BDYTITLE      80A  O  7 24
     A                                  9  4'Menu Sequence:'
     A            BDYSEQ    R        B  9 27REFFLD(MESEQ MENUITEMS)
     A                                      DSPATR(&BDYA)
     A                                 10  4'Menu Name:'
     A            BDYNAME   R        B 10 27REFFLD(MENAME MENUITEMS)
     A                                      CHECK(LC)
     A                                      DSPATR(&BDYA)
     A                                 11  4'Menu Text:'
     A            BDYTEXT   R        B 11 27REFFLD(METEXT MENUITEMS)
     A                                      CHECK(LC)
     A                                      DSPATR(&BDYA)
     A                                 12  4'Menu Program/Command:'
     A            BDYPGM    R        B 12 27REFFLD(MEPGM MENUITEMS)
     A                                      CHECK(LC)
     A                                      DSPATR(&BDYA)
     *************************************************************************
     **  Assume Format
     *************************************************************************
     A          R DUMMY1
     A                                      OVERLAY
     A                                      PUTOVR
     A                                  5  5' '
     ***********************************************************************

