     /*---------------------------------------------------------------------
     /* Program Name:  ST001D
     /* Program Description:  Status Code Maintenance
     /* Program Narrative:  Display the current status codes.  Allow the user
     /*                      to change the description of a current code or
     /*                      to add a new code and description.
     /*
     /* AFTER COMPILE:  CHGDSPF FILE(ST001D) RSTDSP(*YES)
     /*
     /* Change Log:
     /* Marker  Name         Date      Narrative
     /* ------  -----------  --------  -------------------------------------
     /*         S.Meisinger  09/16/25  New Program
     /*---------------------------------------------------------------------
     *************************************************************************
     **  Screen Generics
     *************************************************************************
     A                                      DSPSIZ(27 132 *DS4)
     A                                      CHGINPDFT(UL FE)
     A                                      MSGLOC(27)
     A                                      INDARA
     A                                      ERRSFL
     A                                      PRINT
     A                                      HELP
     *************************************************************************
     **  Header Format
     *************************************************************************
     A          R HEADER1
     A                                      OVERLAY
     A            TITLEA         1A  P
      *
     A            ##PROG        10A  O  1  2
     A            TITLE1        80A     1 26
     A                                      DSPATR(&TITLEA)
     A                                  1123DATE
     A                                      EDTCDE(Y)
     A                                  2  2USER
     A            TITLE2        80A     2 26
     A                                      DSPATR(&TITLEA)
     A                                  2123TIME
     *************************************************************************
     **  Footer Format
     *************************************************************************
     A          R FOOTER1
     A                                      OVERLAY
     A            FERRMSGA       1A  P
     A            FKEYSA         1A  P
     A            FERRMSG       80A    24 22DSPATR(&FERRMSGA)
     A            FKEYLINE     125A    26  3DSPATR(&FKEYSA)
     *************************************************************************
     **  Subfile Format
     *************************************************************************
     A          R SFL1                      SFL
     A  98                                  SFLNXTCHG
     A            SFLRRNR       10S 0H
     A            SFLCSRROW     10S 0H
     A            SFLREPPDN      6S 0H
     A            SFLOA          1A  P
     A            SFLIOA         1A  P
     A            SFAOID         9Y 0H
     A            SFL1RRN        5  0H
     A            SFLOID         9Y 0H
     A            SFLSEL         1A  B  9 13
     A                                      DSPATR(&SFLIOA)
     A            SFLCODE       25A  O  9 23DSPATR(&SFLOA)
     A            SFLDESC       75A  O  9 50DSPATR(&SFLOA)
     *************************************************************************
     **  Subfile Control Format
     *************************************************************************
     A          R SFLCTL1                   SFLCTL(SFL1)
     A                                      CF03
     A                                      CF06
     A                                      SFLSIZ(20)
     A                                      SFLPAG(12)
     A                                      PAGEDOWN(27)
     A                                      KEEP
     A                                      BLINK
     A                                      OVERLAY
     A                                      PUTOVR
     A                                      SFLCSRRRN(&CURSOR)
     A                                      RTNCSRLOC(*MOUSE &ROW &COL)
     A                                      RTNCSRLOC(&CSRRCD &CSRFLD &CSRPOS)
     A  90                                  SFLDSP
     A  91                                  SFLDSPCTL
     A N91                                  SFLCLR
     A  90                                  SFLEND(*MORE)
     A  99                                  ALARM
     **
     A            ROW            3S 0H
     A            COL            3S 0H
     A            SFLRCD         4S 0H      SFLRCDNBR
     A            CSRRCD        10A  H
     A            CSRFLD        10A  H
     A            CSRPOS         4S 0H
     A            CURSOR         5S 0H
     A            OPTIONA        1A  P
     A            HEADERA        1A  P
     A            OPTLINE      100A     6  3
     A                                      DSPATR(&OPTIONA)
     A                                  8 11'Select'
     A                                      DSPATR(&HEADERA)
     A                                  8 21'Code '
     A                                      DSPATR(&HEADERA)
     A                                  8 50'Description'
     A                                      DSPATR(&HEADERA)
     *************************************************************************
     **  Assume Format
     *************************************************************************
     A          R DUMMY1
     A                                      OVERLAY
     A                                      PUTOVR
     A                                  5  5' '
     ***********************************************************************
     **  Delete Window Confirmation
     ***********************************************************************
     A          R DELETEW1
     A                                      WINDOW(10 25 5 90 *NOMSGLIN
     A                                      *NORSTCSR)
     A                                      WDWTITLE((*TEXT 'Confirm Delete') +
     A                                      (*COLOR RED))
     A                                      WDWTITLE((*TEXT 'F12=Cancel') +
     A                                      (*COLOR RED) +
     A                                      *BOTTOM *CENTER)
     A                                      WDWBORDER((*COLOR RED))
     A                                      CF12
     A                                  2  2'Are you sure you want to delete th-
     A                                      is Status Code?'
     A                                       COLOR(WHT)
     A                                  3  2'Code:'
     A                                       COLOR(BLU)
     A            DELCODE       25A  O    +2
     A                                  4  2'Description:'
     A                                       COLOR(BLU)
     A            DELDESC       75A  O    +2
     A                                  5 33'Confirm:'
     A                                       COLOR(WHT)
     A            CONFIRM        1A  B    +2CHECK(ER)
     A                                      VALUES('Y' 'N')
     A                                      DFTVAL('N')
     A                                    +2'(Y/N)'
     ***********************************************************************

