             PGM

             DCL        VAR(&USER) TYPE(*CHAR)

             RTVJOBA    USER(&USER)

             CALL       PGM(MAINR) PARM((&USER))

             ENDPGM
