**FREE
//* General display constant values
//* (Ri=Reverse Image;Hi=Hi Intensity;Bl=Blink;Ul=Underline;Nd=NonDisplay)
//*
//* UnProtected Values
Dcl-C Green                                          Const(x'20');
Dcl-C GreenReverseImange                             Const(x'21');
Dcl-C White                                          Const(x'22');
Dcl-C WhiteReverseImage                              Const(x'23');
Dcl-C GreenUnderline                                 Const(x'24');
Dcl-C GreenUnderlineReverseImage                     Const(x'25');
Dcl-C WhiteUnderline                                 Const(x'26');
Dcl-C NonDisplay                                     Const(x'27');
Dcl-C Red                                            Const(x'28');
Dcl-C RedReverseImage                                Const(x'29');
Dcl-C RedHighIntensity                               Const(x'2A');
Dcl-C RedReverseImageHighIntensity                   Const(x'2B');
Dcl-C RedUnderline                                   Const(x'2C');
Dcl-C RedUnderlineReverseImage                       Const(x'2D');
Dcl-C RedUnderlineBlink                              Const(x'2E');
// NonDisplay                                        Const(x'2F');
Dcl-C TurquoiseColumnSeparator                       Const(x'30');
Dcl-C TurquoiseReverseImageColumnSeparator           Const(x'31');
Dcl-C YellowColumnSeparator                          Const(x'32');
Dcl-C WhiteReverseImageColumnSeparator               Const(x'33');
Dcl-C TurquoiseUnderlineColumnSeparator              Const(x'34');
Dcl-C TurquoiseUnderlineReverseImageColumnSeparator  Const(x'35');
Dcl-C YellowUnderscoreColumnSeparator                Const(x'36');
// NonDisplay                                        Const(x'37');
Dcl-C Pink                                           Const(x'38');
Dcl-C PinkReverseImage                               Const(x'39');
Dcl-C Blue                                           Const(x'3A');
Dcl-C BlueReverseImage                               Const(x'3B');
Dcl-C PinkUnderline                                  Const(x'3C');
Dcl-C PinkUnderlineReverseImage                      Const(x'3D');
Dcl-C BlueUnderline                                  Const(x'3E');
// NonDisplay                                        Const(x'3F');
//
//* Protected Values
Dcl-C ProtectedGreen                                 Const(x'A0');
Dcl-C ProtectedGreenReverseImange                    Const(x'A1');
Dcl-C ProtectedWhite                                 Const(x'A2');
Dcl-C ProtectedWhiteReverseImage                     Const(x'A3');
Dcl-C ProtectedGreenUnderline                        Const(x'A4');
Dcl-C ProtectedGreenUnderlineReverseImage            Const(x'A5');
Dcl-C ProtectedWhiteUnderline                        Const(x'A6');
Dcl-C ProtectedNonDisplay                            Const(x'A7');
Dcl-C ProtectedRed                                   Const(x'A8');
Dcl-C ProtectedRedReverseImage                       Const(x'A9');
Dcl-C ProtectedRedHighIntensity                      Const(x'AA');
Dcl-C ProtectedRedReverseImageHighIntensity          Const(x'AB');
Dcl-C ProtectedRedUnderline                          Const(x'AC');
Dcl-C ProtectedRedUnderlineReverseImage              Const(x'AD');
Dcl-C ProtectedRedUnderlineBlink                     Const(x'AE');
// ProtectedNonDisplay                               Const(x'AF');
Dcl-C ProtectedTurquoiseColumnSeparator              Const(x'B0');
Dcl-C ProtectedTurquoiseReverseImageColumnSeparator  Const(x'B1');
Dcl-C ProtectedYellowColumnSeparator                 Const(x'B2');
Dcl-C ProtectedWhiteReverseImageColumnSeparator      Const(x'B3');
Dcl-C ProtectedTurquoiseUnderlineColumnSeparator     Const(x'B4');
Dcl-C ProtectedTurquoiseUnderlineReverseImageColumnSeparator
Const(x'B5');
Dcl-C ProtectedYellowUnderscoreColumnSeparator       Const(x'B6');
// ProtectedNonDisplay                               Const(x'B7');
Dcl-C ProtectedPink                                  Const(x'B8');
Dcl-C ProtectedPinkReverseImage                      Const(x'B9');
Dcl-C ProtectedBlue                                  Const(x'BA');
Dcl-C ProtectedBlueReverseImage                      Const(x'BB');
Dcl-C ProtectedPinkUnderline                         Const(x'BC');
Dcl-C ProtectedPinkUnderlineReverseImage             Const(x'BD');
Dcl-C ProtectedBlueUnderline                         Const(x'BE');
// NonDisplay                                        Const(x'BF');



