     *************************************************************************
     A                                      DSPSIZ(27 132 *DS4)
     A                                      REF(ITGCMHDS/FTWGMACN)
     A                                      MSGLOC(27)
     A                                      INDARA
     A                                      ERRSFL
     A                                      PRINT
     A                                      HELP
     *************************************************************************
     **  Subfile 1
     *************************************************************************
     A          R SFL1                      SFL
     A            SFLRRNR       10S 0H
     A            SFLCSRROW     10S 0H
     A            SFLREPPDN      6S 0H
     A                                      TEXT('GNMA Action Codes Listing')
     A  39                                  SFLNXTCHG
     A            ##OPTN         1A  B  9  2VALUES(' ' '2' '4')
     A                                      DSPATR(HI)
     A                                      TEXT('Selection')
     A                                      COLOR(GRN)
     A  34                                  DSPATR(ND)
     A            SFAOID         9Y 0H
     A            SFATRF         5A  O  5  2DSPATR(&SFLA)
     A            SFAITM         9A  O  5 11DSPATR(&SFLA)
     A            ##RRN          5  0H
     *
     *************************************************************************
     **  Subfile 1 Control
     *************************************************************************
     A          R SFL1CTL
     A                                      SFLCTL(SFL1)
     A                                      SFLSIZ(20)
     A                                      SFLPAG(12)
     A                                      PAGEDOWN(27)
     A                                      CF12
     A                                      KEEP
     A                                      BLINK
     A                                      OVERLAY
     A  29                                  PUTOVR
     A                                      SFLCSRRRN(&CURSOR)
     A                                      RTNCSRLOC(*MOUSE &ROW &COL)
     A                                      RTNCSRLOC(&CSRRCD &CSRFLD &CSRPOS)
     A  30                                  SFLDSP
     A  31                                  SFLDSPCTL
     A  32                                  SFLCLR
     A  30                                  SFLEND(*MORE)
     A  99                                  ALARM
     A            ROW            3S 0H
     A            COL            3S 0H
     A            DSPSFLRCDR     4S 0H      SFLRCDNBR(CURSOR)
     A            CSRFLD        10A  H
     A            CSRPOS         4S 0H
     A            CURSOR         5S 0H
     A            ##PROG        10A  O  1  2
     A                                  1123DATE
     A                                      EDTCDE(Y)
     A                                  2  2USER
     A                                  2123TIME
     A                                  1 56'GNMA Default Reporting'
     A                                      DSPATR(HI)
     A                                  2 57'Action Codes Listing'
     A                                      DSPATR(HI)
     A                                  4  2'Reporting period:'
     A                                      COLOR(BLU)
     A            #RPTPRD        7A  O    +1
     A                                    +4'Issuer:'
     A                                      COLOR(BLU)
     A*------------------------------------------------------------------------*
     A            OPTLINE      100A     4  3
     A                                      COLOR(BLU)
     ***********************************************************************
     **  Function Keys
     ***********************************************************************
     A          R FNCTNKEYSR
     A            CTLCLSFND1    10A  H
     A            CTLCLSFND2    10A  H
     A            FKYLINE      100A    26  3COLOR(BLU)
     ***********************************************************************
     **  Message Subfile
     ***********************************************************************
     A          R MSGSFL                    SFL
     A                                      SFLMSGRCD(27)
     A            MSGKEY                    SFLMSGKEY
     A            PROGRAM                   SFLPGMQ
     ***********************************************************************
     **  Message Subfile Control
     ***********************************************************************
     A          R MSGCTL                    SFLCTL(MSGSFL)
     A                                      OVERLAY
     A                                      SFLDSP
     A                                      SFLDSPCTL
     A                                      SFLINZ
     A N98                                  SFLEND
     A                                      SFLSIZ(0002)
     A                                      SFLPAG(0001)
     A            PROGRAM                   SFLPGMQ

     ***********************************************************************
     **  Confirmation Prompt
     ***********************************************************************
     A          R CONFIRM
     A                                      CF12
     A                                      WINDOW(12 17 7 34 *NOMSGLIN +
     A                                      *NORSTCSR)
     A                                      WDWTITLE((*TEXT 'Confirm Delete'))
     A                                      WDWTITLE((*TEXT 'F12=Cancel')
     A                                      *BOTTOM)
     A                                      WDWBORDER((*COLOR RED))
     A            CNFMSG1       32A  O  2  2
     A            CNFMSG2       32A  O  3  2
     A            CNFMSG3       32A  O  4  2
     A            YESNO          1A  B  6 11
     A                                  6 13'(Y/N)'
     ***********************************************************************
     **  Edit Window
     ***********************************************************************
     A          R EDITW
     A                                      WINDOW(10 25 3 50 *NOMSGLIN
     A                                      *NORSTCSR)
     A                                      WDWTITLE((*TEXT &TITLE40) +
     A                                      (*COLOR BLU))
     A                                      WDWTITLE(+
     A                                      (*TEXT 'F4=Prompt   F12=Cancel') +
     A                                      (*COLOR BLU) +
     A                                      *BOTTOM)
     A                                      CF12
     A                                      CF04
     A                                      RTNCSRLOC(&RCD &FLD)
     A            TITLE40       40A  P
     A            RCD           10A  H
     A            FLD           10A  H
     A                                  2  2'*Date:'
     A                                      COLOR(BLU)
     A            EDTDATE   R        B    +2REFFLD(FFWGMACN/ACWDFACDT +
     A                                      ITGCMHDS/FTWGMACN)
     A                                      TEXT('Edit Date')
     A                                      DATFMT(*JOB)
     A                                    +5'*Code:'
     A                                      COLOR(BLU)
     A            EDTCODE   R        B    +2REFFLD(FFWGMACN/ACWDFACCD +
     A                                      ITGCMHDS/FTWGMACN)
     A  33                                  DSPATR(RI)
     A  33                                  DSPATR(PC)

     ***********************************************************************
     **  Function Key 1
     ***********************************************************************
     A          R FKEY1
     A            #FKEYOUT     100A    23  2COLOR(BLU)

     ***********************************************************************
     **  Delete Window
     ***********************************************************************
     A          R DELETEW
     A                                      WINDOW(10 25 5 50 *NOMSGLIN
     A                                      *NORSTCSR)
     A                                      WDWTITLE((*TEXT 'Confirm Delete') +
     A                                      (*COLOR RED))
     A                                      WDWTITLE((*TEXT 'F12=Cancel') +
     A                                      (*COLOR RED) +
     A                                      *BOTTOM)
     A                                      WDWBORDER((*COLOR RED))
     A                                      CF12
     A                                  2  2'Are you sure you want to delete -
     A                                      this action code?'
     A                                  4  2'Date:'
     A                                       COLOR(BLU)
     A            DELDATE   R        O    +2REFFLD(FFWGMACN/ACWDFACDT +
     A                                      ITGCMHDS/FTWGMACN)
     A                                      TEXT('Delete Date')
     A                                      DATFMT(*JOB)
     A                                    +5'Code:'
     A                                       COLOR(BLU)
     A            DELCODE   R        O    +2REFFLD(FFWGMACN/ACWDFACCD +
     A                                      ITGCMHDS/FTWGMACN)
     A            CONFIRM        1   B    +5CHECK(ER)
     A                                      VALUES('Y' 'N')
     A                                      DFTVAL('N')
     A                                    +2'(Y/N)'

     ***********************************************************************
     **  Dummy Window
     ***********************************************************************
     A          R DUMMY                     ASSUME
     A                                      KEEP
     A                                      OVERLAY
     A                                  1  2' '

     ***********************************************************************
     **  No Records
     ***********************************************************************
     A          R NOREC                     ASSUME
     A                                      OVERLAY
     A                                 10 25'NO RECORDS WERE FOUND'
     A                                      COLOR(WHT)
     A                                      DSPATR(HI)



