     *************************************************************************
     **  Screen Generics
     *************************************************************************
     A                                      DSPSIZ(27 132 *DS4)
     A                                      CHGINPDFT(UL FE)
     A                                      MSGLOC(27)
     A                                      INDARA
     A                                      ERRSFL
     A                                      PRINT
     A                                      HELP
     *************************************************************************
     **  Header Format
     *************************************************************************
     A          R HEADER1
     A            TITLEA         1A  P
      *
     A            ##PROG        10A  O  1  2
     A            TITLE1        80A     1 26
     A                                      DSPATR(&TITLEA)
     A                                  1123DATE
     A                                      EDTCDE(Y)
     A                                  2  2USER
     A            TITLE2        80A     2 26
     A                                      DSPATR(&TITLEA)
     A                                  2123TIME
     *************************************************************************
     **  Body Format
     *************************************************************************
     A          R BODY1
     A                                      OVERLAY
     *************************************************************************
     **  Footer Format
     *************************************************************************
     A          R FOOTER1
     A                                      OVERLAY
     A            CTLCLSFND1    10A  H
     A            CTLCLSFND2    10A  H
     A            FKEYSA         1A  P
     A            FKEYLINE     125A    26  3DSPATR(&FKEYSA)
     *************************************************************************
     **  Subfile Format
     *************************************************************************
     A          R SFL1                      SFL
     A  98                                  SFLNXTCHG
     A            SFLRRNR       10S 0H
     A            SFLCSRROW     10S 0H
     A            SFLREPPDN      6S 0H
     A            SFLOA          1A  P
     A            SFLIOA         1A  P
     A            ##OPTN         1A  B  7  2VALUES(' ' '2' '4')
     A                                      DSPATR(&SFLIOA)
     A            SFAOID         9Y 0H
     A            SFL1RRN        5  0H
     A            SFOID          9Y 0H
     A            SFFLD1         9A  O  7 11DSPATR(&SFLOA)
     A            SFFLD2         2A  O  7 23DSPATR(&SFLOA)
     A            SFFLD3         8Y 0O  7 29EDTWRD('    /  /  ')
     *************************************************************************
     **  Subfile Control Format
     *************************************************************************
     A          R SFLCTL1                   SFLCTL(SFL1)
     A                                      SFLSIZ(20)
     A                                      SFLPAG(12)
     A                                      PAGEDOWN(27)
     A                                      CF12
     A                                      KEEP
     A                                      BLINK
     A                                      OVERLAY
     A                                      PUTOVR
     A                                      SFLCSRRRN(&CURSOR)
     A                                      RTNCSRLOC(*MOUSE &ROW &COL)
     A                                      RTNCSRLOC(&CSRRCD &CSRFLD &CSRPOS)
     A  90                                  SFLDSP
     A  91                                  SFLDSPCTL
     A N91                                  SFLCLR
     A  90                                  SFLEND(*MORE)
     A  99                                  ALARM
     **
     A            ROW            3S 0H
     A            COL            3S 0H
     A            SFLFLRCDR      4S 0H      SFLRCDNBR(CURSOR)
     A            CSRRCD        10A  H
     A            CSRFLD        10A  H
     A            CSRPOS         4S 0H
     A            CURSOR         5S 0H
     A            OPTIONA        1A  P
     A            HEADERA        1A  P
     A            OPTLINE      100A     4  3
     A                                      DSPATR(&OPTIONA)
     A                                  6 22'Column 1'
     A                                      DSPATR(&HEADERA)
     A                                  6 45'Column 2'
     A                                      DSPATR(&HEADERA)
     *************************************************************************
     **  Window Format
     *************************************************************************
     A          R WINDOW1
     A                                      WINDOW(3 12 18 58)
     A                                      WDWBORDER((*COLOR BLU) (*DSPATR RI)-
     A                                       (*CHAR '        '))
     A                                      USRRSTDSP
     ***********************************************************************
     **  Message Subfile
     ***********************************************************************
     A          R MSGSFL1                   SFL
     A                                      SFLMSGRCD(27)
     A            MSGKEY                    SFLMSGKEY
     A            PROGRAM                   SFLPGMQ
     ***********************************************************************
     **  Message Subfile Control
     ***********************************************************************
     A          R MSGCTL1                   SFLCTL(MSGSFL1)
     A                                      OVERLAY
     A                                      SFLDSP
     A                                      SFLDSPCTL
     A N97                                  SFLEND
     A                                      SFLSIZ(0002)
     A                                      SFLPAG(0001)
     *************************************************************************
     **  Assume Format
     *************************************************************************
     A          R ASMFMT1
     A                                      ASSUME
     A                                      OVERLAY
     A                                      PUTOVR
     A                                  8 26' '
     ***********************************************************************
     **  Dummy Window
     ***********************************************************************
     A          R DUMMY1                    ASSUME
     A                                      KEEP
     A                                      OVERLAY
     A                                  1  2' '
     ***********************************************************************
     **  No Records
     ***********************************************************************
     A          R NOREC1                    ASSUME
     A                                      OVERLAY
     A                                 10 25'NO RECORDS WERE FOUND'
     A                                      COLOR(WHT)
     A                                      DSPATR(HI)
     ***********************************************************************
     **  Delete Window Confirmation
     ***********************************************************************
     A          R DELETEW1
     A                                      WINDOW(10 25 5 50 *NOMSGLIN
     A                                      *NORSTCSR)
     A                                      WDWTITLE((*TEXT 'Confirm Delete') +
     A                                      (*COLOR RED))
     A                                      WDWTITLE((*TEXT 'F12=Cancel') +
     A                                      (*COLOR RED) +
     A                                      *BOTTOM)
     A                                      WDWBORDER((*COLOR RED))
     A                                      CF12
     A                                  2  2'Are you sure you want to delete -
     A                                      this action code?'
     A                                  4  2'Date:'
     A                                       COLOR(BLU)
     A            DELDATE        8Y 0O    +2
     A                                    +5'Code:'
     A                                       COLOR(BLU)
     A            DELCODE        1A  O    +2
     A            CONFIRM        1A  B    +5CHECK(ER)
     A                                      VALUES('Y' 'N')
     A                                      DFTVAL('N')
     A                                    +2'(Y/N)'
     ***********************************************************************
     **  Confirmation Prompt
     ***********************************************************************
     A          R CONFIRM1
     A                                      CF12
     A                                      WINDOW(12 17 7 34 *NOMSGLIN +
     A                                      *NORSTCSR)
     A                                      WDWTITLE((*TEXT 'Confirm Delete'))
     A                                      WDWTITLE((*TEXT 'F12=Cancel')
     A                                      *BOTTOM)
     A                                      WDWBORDER((*COLOR RED))
     A            CNFMSG1       32A  O  2  2
     A            CNFMSG2       32A  O  3  2
     A            CNFMSG3       32A  O  4  2
     A            YESNO          1A  B  6 11
     A                                  6 13'(Y/N)'


